/**
 ******************************************************************************
 * @file           : tsk_usb.cpp
 * @brief          : 中断服务程序
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 GMaster
 * All rights reserved.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "tsk_usb.hpp"
#include "crt_gimbal.hpp"
#include "usb_device.h"

/* Typedef -------------------------------------------------------------------*/

/* Define --------------------------------------------------------------------*/

/* Macro ---------------------------------------------------------------------*/

/* Variables -----------------------------------------------------------------*/
extern Gimbal gimbal;
vision_rx_t vision_rx = {};

/* Function prototypes -------------------------------------------------------*/

/* User code -----------------------------------------------------------------*/

extern "C" void usb_task(void *argument)
{
    MX_USB_DEVICE_Init();
    TickType_t taskLastWakeTime = xTaskGetTickCount(); // 获取任务开始时间
    while (1) {
        gimbal.sendUsbData();
        vTaskDelayUntil(&taskLastWakeTime, 5); // 确保任务以定周期5ms运行
    }
}
